[
  {
    "file": "srcB/.env.example",
    "occurrences": 1,
    "samples": [
      {
        "line": 2,
        "text": "APP_ORIGIN=https://haitacmanhnhat.vn"
      }
    ]
  },
  {
    "file": "srcB/reports/duplicates.json",
    "occurrences": 6005,
    "samples": [
      {
        "line": 5,
        "text": "\"canonical\": \"haitacmanhnhat.vn/assets/stms/css/bootstrap.min.css\","
      },
      {
        "line": 7,
        "text": "\"haitacmanhnhat.vn/assets/stms/css/bootstrap.min.css\","
      },
      {
        "line": 8,
        "text": "\"haitacmanhnhat.vn/assets/stms/css/bootstrap.min.css\","
      },
      {
        "line": 9,
        "text": "\"haitacmanhnhat.vn/assets/stms/css/bootstrap.min.css\","
      },
      {
        "line": 10,
        "text": "\"haitacmanhnhat.vn/assets/stms/css/bootstrap.min.css\","
      }
    ]
  },
  {
    "file": "srcB/reports/alias-map.json",
    "occurrences": 2158,
    "samples": [
      {
        "line": 6,
        "text": "\"source\": \"haitacmanhnhat.vn/assets/stms/css/bootstrap.min.css\","
      },
      {
        "line": 8,
        "text": "\"html\": \"haitacmanhnhat.vn/update/vuong-gia-chien-lan-2-197.html\""
      },
      {
        "line": 13,
        "text": "\"source\": \"haitacmanhnhat.vn/assets/stms/css/all.min.css\","
      },
      {
        "line": 15,
        "text": "\"html\": \"haitacmanhnhat.vn/update/vuong-gia-chien-lan-2-197.html\""
      },
      {
        "line": 20,
        "text": "\"source\": \"haitacmanhnhat.vn/assets/stms/css/slick.css\","
      }
    ]
  },
  {
    "file": "srcB/reports/bundles.json",
    "occurrences": 28,
    "samples": [
      {
        "line": 3,
        "text": "\"haitacmanhnhat.vn/assets/stms/css/bootstrap.min.css\","
      },
      {
        "line": 4,
        "text": "\"haitacmanhnhat.vn/assets/stms/css/all.min.css\","
      },
      {
        "line": 5,
        "text": "\"haitacmanhnhat.vn/assets/stms/css/slick.css\","
      },
      {
        "line": 6,
        "text": "\"haitacmanhnhat.vn/assets/stms/css/slick-theme.css\","
      },
      {
        "line": 7,
        "text": "\"haitacmanhnhat.vn/assets/stms/css/daterangepicker.css\","
      }
    ]
  },
  {
    "file": "srcB/app/Views/partials/analytics-inline.php",
    "occurrences": 1,
    "samples": [
      {
        "line": 3,
        "text": "var DOMAIN = 'haitacmanhnhat.vn';"
      }
    ]
  },
  {
    "file": "srcB/app/data/news/dieu-khoan-dich-vu.json",
    "occurrences": 1,
    "samples": [
      {
        "line": 5,
        "text": "\"content_html\": \"<p><strong><span style=\\\"color:#c0392b\\\">I. CHẤP NHẬN CÁC ĐIỀU KHOẢN</span></strong></p>\\n<p style=\\\"margin-left:40px\\\">1. Bằng việc truy cập hay sử dụng dịch vụ của chúng tôi, bạn xác nhận rằng bạn đồng ý bị ràng buộc bởi Điều khoản Dịch vụ này. Bạn cũng xác nhận rằng bạn ít nhất 14 tuổi hoặc nếu bạn dưới 14 tuổi, bạn có sự cho phép của cha mẹ hoặc người giám hộ hợp pháp, những người này sẽ chịu trách nhiệm về việc tuân thủ Điều khoản Dịch vụ này của bạn.<br/>\\n2. Các điều khoản này có thể được chúng tôi cập nhật. Bạn có thể xem bản mới nhất của Điều khoản Dịch vụ bất kỳ lúc nào tại đây. Việc bạn tiếp tục sử dụng Dịch vụ sau khi chúng tôi có bất kỳ thay đổi trong Điều khoản Dịch vụ thể hiện sự chấp nhận Điều khoản Dịch vụ mới của bạn.<br/>\\n3. Bạn có thể chấm dứt việc sử dụng Dịch vụ của chúng tôi nếu bạn không đồng ý tuân thủ các Điều khoản Dịch vụ này hoặc bất kỳ Điều khoản Dịch vụ nào trong tương lai do chúng tôi quy định.</p>\\n<p><strong><span style=\\\"color:#c0392b\\\">II. TÀI KHOẢN</span></strong></p>\\n<p style=\\\"margin-left:40px\\\">Dịch vụ cho phép người dùng (\\\"Người dùng\\\") đăng ký tài khoản trên Dịch vụ để tạo và cập nhật hồ sơ trực tuyến trên haitacmanhnhat.vn. Mỗi người dùng có thể tạo nhiều tài khoản khác nhau trên haitacmanhnhat.vn sử dụng các hình thức đăng nhập thông qua Email, số điện thoại, Facebook, hoặc Google.</p>\\n<p><strong><span style=\\\"color:#c0392b\\\">III. ĐĂNG KÝ</span></strong></p>\\n<p style=\\\"margin-left:40px\\\">1. Để truy cập và sử dụng dịch vụ được cung cấp trên website haitacmanhnhat.vn, Người dùng có thể sẽ được yêu cầu đăng ký Thành Viên trên website haitacmanhnhat.vn, thông tin bắt buộc cần phải điền vào mẫu đăng ký Thành Viên gồm: Họ và tên, ngày sinh, email, số điện thoại liên lạc, địa chỉ, chứng minh thư nhân dân, hộ chiếu hoặc căn cước,... Thành Viên tự chịu trách nhiệm về những thông tin đã cung cấp, website haitacmanhnhat.vn không chịu bất kỳ trách nhiệm hay nghĩa vụ liên quan đến thông tin đã cung cấp của Thành Viên.<br/>\\n2. Bạn có trách nhiệm duy trì tính bảo mật của mật khẩu và tài khoản của mình, và hoàn toàn chịu trách nhiệm cho tất cả các hoạt động diễn ra của tài khoản đó. Mỗi tài khoản phải được sử dụng riêng và không được chuyển nhượng. Bạn đồng ý:</p>\\n<p style=\\\"margin-left:80px\\\">2.1. Sử dụng tài khoản của bạn cho cá nhân mình và không chia sẻ tài khoản với người khác.<br/>\\n2.2. Thông báo ngay cho chúng tôi bằng văn bản về việc sử dụng trái phép mật khẩu hoặc tài khoản của bạn hoặc bất kỳ vi phạm nào khác về bảo mật.<br/>\\n2.3. Cung cấp thông tin đúng, chính xác, cập nhật và đầy đủ về bản thân theo hướng dẫn trong mẫu đăng ký Dịch vụ.<br/>\\n2.4. Duy trì và cập nhật Dữ liệu Đăng ký để đảm bảo rằng dữ liệu đúng, chính xác, cập nhật và đầy đủ.</p>\\n<p style=\\\"margin-left:40px\\\">3. Trường hợp bạn chưa đủ 14 tuổi, bạn cần được sự cho phép của người giám hộ hợp pháp đăng ký tài khoản cho bạn.</p>\\n<p><strong><span style=\\\"color:#c0392b\\\">IV. CHÍNH SÁCH BẢO MẬT THÔNG TIN</span></strong></p>\\n<p style=\\\"margin-left:40px\\\">1. Dữ liệu Đăng ký và một số thông tin khác về bạn phải tuân theo Chính sách về Quyền riêng tư của chúng tôi, các điều khoản của chính sách được kết hợp vào các Điều khoản Dịch vụ này bằng cách tham chiếu. Việc xác định xem dữ liệu cá nhân nào có thể được chia sẻ trên Hồ sơ của bạn sẽ theo ý của bạn và là trách nhiệm của bạn. Bằng cách đăng ký Dịch vụ, bạn chấp nhận các điều khoản của Điều khoản Dịch vụ này, đồng thời, cũng cho biết bạn hiểu và đồng ý với việc thu thập, sử dụng và tiết lộ thông tin được mô tả trong Chính sách về Quyền riêng tư của chúng tôi.</p>\\n<p><strong><span style=\\\"color:#c0392b\\\">V. NỘI DUNG NGƯỜI DÙNG VÀ HÀNH VI ĐỐI VỚI DỊCH VỤ</span></strong></p>\\n<p style=\\\"margin-left:40px\\\">1. Một số phần của Dịch vụ cho phép bạn tải lên trên Dịch vụ của chúng tôi bao gồm các thông tin trong phần Thông tin Đăng ký thành viên như tên, ảnh đại diện, email, số điện thoại,… Tất cả các thông tin được Người dùng đăng, tải lên, gửi qua email thuộc quyền sở hữu và trách trách nhiệm của người dùng. haitacmanhnhat.vn không chịu trách nhiệm cho bất kỳ Nội dung nào mà Người dùng tải lên, đăng, gửi email, truyền tải hoặc làm cho có sẵn thông qua Dịch vụ đồng thời không bảo đảm tính chính xác, nguyên vẹn hoặc chất lượng của các nội dung đó.<br/>\\n2. Bạn chấp thuận rằng haitacmanhnhat.vn không giám sát Nội dung Người dùng, nhưng haitacmanhnhat.vn sẽ có quyền (nhưng không phải là nghĩa vụ) từ chối, di chuyển hoặc xóa bất kỳ Nội dung Người dùng nào mà vi phạm các Điều khoản Dịch vụ hoặc (theo ý kiến của haitacmanhnhat.vn) là không hợp lệ.<br/>\\n3. haitacmanhnhat.vn không tuyên bố quyền sở hữu Nội dung Người dùng. Bằng việc gửi Nội dung Người dùng tới Dịch vụ, bạn cấp cho haitacmanhnhat.vn giấy phép trên toàn thế giới, không có phí bản quyền và độc quyền để tái tạo, chỉnh sửa và xuất bản Nội dung Người dùng.<br/>\\n4. Bạn đồng ý sử dụng Dịch vụ một cách cẩn trọng, thích hợp và hợp pháp và đảm bảo rằng bạn không vi phạm luật pháp hiện hành của quốc gia hoặc quốc tế hoặc bất kỳ quyền nào của các bên thứ ba (bao gồm cả thương hiệu, bí mật thương mại, bản quyền hoặc quyền sở hữu khác). Đặc biệt, bạn đồng ý không sử dụng Dịch vụ để:</p>\\n<p style=\\\"margin-left:80px\\\">4.1. Tải lên, đăng, bình luận, gửi email, truyền hoặc cung cấp bất kỳ Nội dung Người dùng trái pháp luật, gây hại, đe dọa, lạm dụng, quấy rối, phỉ báng, có liên quan đến chính trị, tôn giáo, có nội dung thô tục, khiêu dâm, bôi nhọ, xâm phạm quyền riêng tư của người khác, căm hờn hoặc phân biệt chủng tộc, dân tộc hoặc gây khó chịu;<br/>\\n4.2. Gây hại cho trẻ vị thành niên bằng bất kỳ cách nào;<br/>\\n4.3. Mạo danh bất kỳ cá nhân hoặc tổ chức, bao gồm nhưng không giới hạn, cán bộ, người hướng dẫn hoặc chủ của haitacmanhnhat.vn, hoặc nói sai hay xuyên tạc quan hệ của bạn với bất kỳ cá nhân hoặc tổ chức nào;<br/>\\n4.4. Sử dụng Dịch vụ làm dịch vụ chuyển tiếp đến một trang web khác;<br/>\\n4.5. Giả mạo tiêu đề hoặc sửa đổi nội dung được truyền qua Dịch vụ nhằm che giấu nguồn gốc của nội dung đó;<br/>\\n4.6. Tải lên, đăng, gửi email, truyền hoặc cung cấp bất kỳ Nội dung Người dùng nào mà bạn không có quyền cung cấp theo bất kỳ luật hoặc theo các mối quan hệ hợp đồng hoặc ủy thác (chẳng hạn như thông tin nội bộ, thông tin độc quyền và bí mật được biết đến hoặc tiết lộ như một phần của mối quan hệ công việc);<br/>\\n4.7. Tải lên, đăng, gửi email, truyền hoặc cung cấp Nội dung Người dùng vi phạm Quyền sở hữu trí tuệ (như quy định tại khoản X), hoặc quyền bảo mật của bất kỳ bên nào;<br/>\\n5.8. Tải lên, đăng, gửi email, truyền hoặc cung cấp bất kỳ quảng cáo không mong muốn hoặc không được phép, tài liệu quảng bá, \\\"thư rác\\\", hoặc bất kỳ hình thức quảng cáo nào khác;<br/>\\n4.9. Tải lên, đăng, gửi email, truyền hoặc cung cấp bất kỳ tài liệu nào chứa các virút phần mềm hoặc mã, tập tin hoặc chương trình máy tính khác được thiết kế để gây cản trở, phá hỏng hoặc hạn chế chức năng của phần mềm, phần cứng máy tính hay thiết bị viễn thông;<br/>\\n4.10. Gây cản trở hoặc phá rối Dịch vụ hoặc máy chủ, mạng kết nối với Dịch vụ, hoặc không tuân thủ bất kỳ yêu cầu, thủ tục, chính sách hoặc quy định của mạng kết nối với Dịch vụ;<br/>\\n4.11. Quấy rối Người dùng khác;<br/>\\n4.12. Thu thập hoặc lưu trữ dữ liệu cá nhân của Người dùng khác liên quan tới các hành vi và hoạt động bị cấm được nêu trong các phần trên; và/hoặc<br/>\\n4.13. Quảng bá các trang web hoặc dịch vụ khác không liên quan tới Dịch vụ được cung cấp bởi haitacmanhnhat.vn.</p>\\n<p style=\\\"margin-left:40px\\\">5. Bạn thừa nhận và đồng ý rằng haitacmanhnhat.vn có thể bảo lưu Nội dung Người dùng và cũng có thể tiết lộ Nội dung Người dùng theo yêu cầu của luật pháp hoặc khi tin tưởng một cách thiện chí rằng việc bảo lưu hoặc tiết lộ đó là cần thiết hợp lý để: (a) Tuân theo quy trình pháp lý; (b) Thực thi các Điều khoản Dịch vụ hoặc các Điều khoản về Dịch vụ phải trả tiền; (c) Giải quyết khiếu nại cho rằng Nội dung Người dùng vi phạm các quyền của bên thứ ba; hoặc (d) Bảo vệ quyền lợi, tài sản, hoặc sự an toàn cá nhân của haitacmanhnhat.vn, Người dùng của haitacmanhnhat.vn và công chúng.</p>\\n<p><strong><span style=\\\"color:#c0392b\\\">VI. NỘI DUNG BÊN THỨ BA VÀ LIÊN KẾT TỚI WEBSITE CỦA BÊN THỨ BA</span></strong></p>\\n<p style=\\\"margin-left:40px\\\">haitacmanhnhat.vn có thể chứa nội dung của bên thứ ba và liên kết đến các trang web khác (\\\"Trang web liên kết\\\"). haitacmanhnhat.vn không xác nhận, tài trợ, giới thiệu, hoặc chấp nhận trách nhiệm về bất kỳ Trang web liên kết nào. Ngoài ra, Trang web liên kết không thuộc sự kiểm soát của haitacmanhnhat.vn, và haitacmanhnhat.vn không chịu trách nhiệm về nội dung hoặc thực hành về quyền riêng tư của Trang web liên kết, bao gồm nhưng không giới hạn, các liên kết chứa trên Trang web liên kết hoặc bất cứ thay đổi hoặc cập nhật nào đối với Trang web liên kết.</p>\\n<p><strong><span style=\\\"color:#c0392b\\\">VII. CHẤM DỨT</span></strong></p>\\n<p style=\\\"margin-left:40px\\\">1. Bạn đồng ý rằng haitacmanhnhat.vn có thể chấm dứt tài khoản của bạn khi haitacmanhnhat.vn có lý do để tin rằng bạn đã vi phạm hoặc đã không tuân thủ Điều khoản Dịch vụ. Sau chấm dứt đó, haitacmanhnhat.vn có thể xóa và gỡ bỏ bất kỳ Nội dung Người dùng nào của bạn trong Dịch vụ.<br/>\\n2. haitacmanhnhat.vn có toàn quyền sửa đổi hoặc ngừng tạm thời hoặc vĩnh viễn Dịch vụ (hoặc bất kỳ phần nào của Dịch vụ) bất cứ lúc nào. Bạn đồng ý rằng haitacmanhnhat.vn không chịu trách nhiệm với bạn hoặc với bất kỳ bên thứ ba nào về việc sửa đổi hoặc ngừng cung cấp Dịch vụ (ngoại trừ phạm vi quy định tại khoản IV trên đây đối với các Dịch vụ phải trả phí), trừ khi có thoả thuận khác giữa haitacmanhnhat.vn và bên thứ ba đó.</p>\\n<p><strong><span style=\\\"color:#c0392b\\\">VIII. QUYỀN SỞ HỮU TRÍ TUỆ</span></strong></p>\\n<p style=\\\"margin-left:40px\\\">1. Bạn thừa nhận và đồng ý rằng tất cả Quyền sở hữu trí tuệ trong Dịch vụ, bất kỳ phần mềm cần thiết được sử dụng liên quan tới Dịch vụ, và tất cả nội dung (bao gồm cả văn bản, video, âm thanh, hình ảnh hoặc tài liệu khác...) chứa trên Dịch vụ ngoài Nội dung Người dùng (\\\"Nội dung\\\") thuộc về haitacmanhnhat.vn và bên cấp phép của haitacmanhnhat.vn.<br/>\\n2. Bạn chấp thuận và cam kết rằng không sử dụng hay sao chép bất kỳ nội dung nào trên Dịch vụ (bao gồm cả văn bản, video, âm thanh, hình ảnh hoặc tài liệu khác...) mà chưa được phép bằng văn bản.<br/>\\n3. Bằng việc sử dụng dịch vụ, bạn cam kết rằng:</p>\\n<p style=\\\"margin-left:80px\\\">3. 1. Không truy cập vào Dịch vụ hoặc Nội dung bằng bất cứ phương tiện nào ngoài thông qua các giao diện được cung cấp bởi haitacmanhnhat.vn để sử dụng trong việc truy cập Dịch vụ; hoặc<br/>\\n3. 2. Trừ khi được cho phép rõ ràng bởi haitacmanhnhat.vn hoặc các bên thứ ba có liên quan (bao gồm cả các nhà quảng cáo bên thứ ba), không được sửa đổi, thuê, cho thuê, cho vay, bán, phân phối hoặc tạo ra các tác phẩm dựa trên Dịch vụ, toàn bộ hoặc một phần.</p>\\n<p><strong><span style=\\\"color:#c0392b\\\">IX. LIÊN HỆ</span></strong></p>\\n<p style=\\\"margin-left:40px\\\">1. Hãy liên lạc với chúng tôi khi có bất kỳ thắc mắc hoặc để báo cáo bất kỳ hành vi vi phạm các Điều khoản Dịch vụ theo địa chỉ haitacmanhnhat.vn<br/>\\n2. haitacmanhnhat.vn có thể liên lạc với bạn và gửi cho bạn các thông báo, bao gồm cả thông báo liên quan đến những thay đổi trong Điều khoản Dịch vụ này, qua email, điện thoại bằng cách đăng ký nhận thông báo.</p>\","
      }
    ]
  },
  {
    "file": "srcB/app/data/news/14-06-tai-truoc-hai-tac-manh-nhat-ngay-hom-nay-31.json",
    "occurrences": 1,
    "samples": [
      {
        "line": 5,
        "text": "\"content_html\": \"<p>Chào các thuyền trưởng,</p>\\n<p>Sau hành trình dài được cộng đồng mong đợi, Hải Tặc Mạnh Nhất – game chiến thuật thẻ tướng chuẩn nguyên tác One Piece sẽ <strong><span style=\\\"color:#e74c3c\\\">chính thức khai mở vào lúc 10h ngày 16/06/2025!</span></strong></p>\\n<p>Để sẵn sàng bước vào đại hải trình, chiêu mộ 99+ tướng độc quyền và khám phá những tính năng chưa từng có, các thuyền trưởng có thể tải game sớm từ hôm nay tại: <a href=\\\"/index.html\\\" target=\\\"_blank\\\">haitacmanhnhat.vn</a></p>\\n<h1>THỰC HIỆN TẢI GAME SỚM</h1>\\n<ul>\\n<li>Phiên bản game chính thức: <a class=\\\"link-download-client\\\" href=\\\"#\\\"><span style=\\\"color:#3498db\\\">tải tại đây</span></a></li>\\n<li>Sau đó tiến hành <strong><span style=\\\"color:#e74c3c\\\">“install”</span></strong> để chạy file cài đặt vừa tải về</li>\\n</ul>\\n<p style=\\\"text-align:center\\\"><img alt=\\\"\\\" src=\\\"/assets/stms/files/uploads/files/Content/caigame.png\\\" style=\\\"height:393px; width:523px\\\"/></p>\\n<ul>\\n<li>Sau khi cài đặt xong Client sẽ tự bật lên và Shortcut của Client sẽ tự động tạo ở ngoài Desktop</li>\\n</ul>\\n<p style=\\\"text-align:center\\\"><img alt=\\\"\\\" src=\\\"/assets/stms/files/uploads/files/Content/1606.jpg\\\" style=\\\"height:356px; width:650px\\\"/></p>\\n<ul>\\n<li>Thời gian mở máy chủ chính thức: <strong><span style=\\\"color:#e74c3c\\\">10:00 ngày 16/06/2025</span></strong><br/>\\n\\t </li>\\n</ul>\\n<h1>NHỮNG NỘI DUNG NỔI BẬT KHÔNG THỂ BỎ QUA</h1>\\n<ul>\\n<li><strong>99+ tướng độc quyền - Chuẩn nguyên tác</strong></li>\\n<li><strong>Bí Kíp Hải Tặc – Tân Thủ Không Còn Lạc Lối </strong></li>\\n<li><strong>Chiến thuật sâu – trận hình chuẩn – tự tạo meta</strong></li>\\n<li><strong>Đua Top Hải Trình – Khẳng Định Vị Thế</strong></li>\\n<li><strong>Tính Năng Độc Quyền – Không Sao Chép</strong></li>\\n<li><strong>Dân Cày Sống Khỏe – Quà Nhận Mỏi Tay</strong></li>\\n</ul>\\n<h1>GIFTCODE DÀNH CHO TÂN THỦ</h1>\\n<ul>\\n<li><strong>HAITACMANHNHAT-TANTHU </strong>(HSD: Vĩnh viễn)</li>\\n<li><strong>LIKENHANCODE-HTMN </strong>(HSD: 31.08.2025)</li>\\n<li><strong>RAMATTRAILER-HTMN </strong>(HSD: 31.08.2025)</li>\\n<li><strong>TAICLIENTNHANQUA-HTMN </strong>(HSD: 31.08.2025) </li>\\n<li><strong>CHINHTHUCRAMAT-HTMN </strong>(HSD: 31.08.2025)</li>\\n<li><strong>RAMATMAYCHU-HTMN </strong>(HSD: 31.08.2025)<br/>\\n\\t </li>\\n</ul>\\n<p>Tải game ngay: <a class=\\\"link-download-client\\\" href=\\\"#\\\"><span style=\\\"color:#3498db\\\">tải tại đây</span></a><br/>\\nNếu gặp khó khăn trong quá trình cài đặt, vui lòng liên hệ <a href=\\\"https://www.facebook.com/haitacmanhnhat\\\" target=\\\"_blank\\\"><span style=\\\"color:#3498db\\\">Fanpage Hải Tặc Mạnh Nhất</span></a> hoặc <a href=\\\"http://discord.com/invite/pRQaVmUj78\\\" target=\\\"_blank\\\"><span style=\\\"color:#3498db\\\">kênh Discord</span></a>, <a href=\\\"https://zalo.me/096316662\\\" target=\\\"_blank\\\"><span style=\\\"color:#3498db\\\">Zalo</span></a> để được hỗ trợ nhanh nhất!<br/>\\nHẹn gặp lại các thuyền trưởng tại Đại Hải Trình vào lúc 10h sáng ngày 16/06/2025!</p>\","
      }
    ]
  },
  {
    "file": "srcB/app/data/news/dieu-khoan-dich-vu-11.json",
    "occurrences": 1,
    "samples": [
      {
        "line": 5,
        "text": "\"content_html\": \"<p><strong><span style=\\\"color:#c0392b\\\">I. CHẤP NHẬN CÁC ĐIỀU KHOẢN</span></strong></p>\\n<p style=\\\"margin-left:40px\\\">1. Bằng việc truy cập hay sử dụng dịch vụ của chúng tôi, bạn xác nhận rằng bạn đồng ý bị ràng buộc bởi Điều khoản Dịch vụ này. Bạn cũng xác nhận rằng bạn ít nhất 14 tuổi hoặc nếu bạn dưới 14 tuổi, bạn có sự cho phép của cha mẹ hoặc người giám hộ hợp pháp, những người này sẽ chịu trách nhiệm về việc tuân thủ Điều khoản Dịch vụ này của bạn.<br/>\\n2. Các điều khoản này có thể được chúng tôi cập nhật. Bạn có thể xem bản mới nhất của Điều khoản Dịch vụ bất kỳ lúc nào tại đây. Việc bạn tiếp tục sử dụng Dịch vụ sau khi chúng tôi có bất kỳ thay đổi trong Điều khoản Dịch vụ thể hiện sự chấp nhận Điều khoản Dịch vụ mới của bạn.<br/>\\n3. Bạn có thể chấm dứt việc sử dụng Dịch vụ của chúng tôi nếu bạn không đồng ý tuân thủ các Điều khoản Dịch vụ này hoặc bất kỳ Điều khoản Dịch vụ nào trong tương lai do chúng tôi quy định.</p>\\n<p><strong><span style=\\\"color:#c0392b\\\">II. TÀI KHOẢN</span></strong></p>\\n<p style=\\\"margin-left:40px\\\">Dịch vụ cho phép người dùng (\\\"Người dùng\\\") đăng ký tài khoản trên Dịch vụ để tạo và cập nhật hồ sơ trực tuyến trên haitacmanhnhat.vn. Mỗi người dùng có thể tạo nhiều tài khoản khác nhau trên haitacmanhnhat.vn sử dụng các hình thức đăng nhập thông qua Email, số điện thoại, Facebook, hoặc Google.</p>\\n<p><strong><span style=\\\"color:#c0392b\\\">III. ĐĂNG KÝ</span></strong></p>\\n<p style=\\\"margin-left:40px\\\">1. Để truy cập và sử dụng dịch vụ được cung cấp trên website haitacmanhnhat.vn, Người dùng có thể sẽ được yêu cầu đăng ký Thành Viên trên website haitacmanhnhat.vn, thông tin bắt buộc cần phải điền vào mẫu đăng ký Thành Viên gồm: Họ và tên, ngày sinh, email, số điện thoại liên lạc, địa chỉ, chứng minh thư nhân dân, hộ chiếu hoặc căn cước,... Thành Viên tự chịu trách nhiệm về những thông tin đã cung cấp, website haitacmanhnhat.vn không chịu bất kỳ trách nhiệm hay nghĩa vụ liên quan đến thông tin đã cung cấp của Thành Viên.<br/>\\n2. Bạn có trách nhiệm duy trì tính bảo mật của mật khẩu và tài khoản của mình, và hoàn toàn chịu trách nhiệm cho tất cả các hoạt động diễn ra của tài khoản đó. Mỗi tài khoản phải được sử dụng riêng và không được chuyển nhượng. Bạn đồng ý:</p>\\n<p style=\\\"margin-left:80px\\\">2.1. Sử dụng tài khoản của bạn cho cá nhân mình và không chia sẻ tài khoản với người khác.<br/>\\n2.2. Thông báo ngay cho chúng tôi bằng văn bản về việc sử dụng trái phép mật khẩu hoặc tài khoản của bạn hoặc bất kỳ vi phạm nào khác về bảo mật.<br/>\\n2.3. Cung cấp thông tin đúng, chính xác, cập nhật và đầy đủ về bản thân theo hướng dẫn trong mẫu đăng ký Dịch vụ.<br/>\\n2.4. Duy trì và cập nhật Dữ liệu Đăng ký để đảm bảo rằng dữ liệu đúng, chính xác, cập nhật và đầy đủ.</p>\\n<p style=\\\"margin-left:40px\\\">3. Trường hợp bạn chưa đủ 14 tuổi, bạn cần được sự cho phép của người giám hộ hợp pháp đăng ký tài khoản cho bạn.</p>\\n<p><strong><span style=\\\"color:#c0392b\\\">IV. CHÍNH SÁCH BẢO MẬT THÔNG TIN</span></strong></p>\\n<p style=\\\"margin-left:40px\\\">1. Dữ liệu Đăng ký và một số thông tin khác về bạn phải tuân theo Chính sách về Quyền riêng tư của chúng tôi, các điều khoản của chính sách được kết hợp vào các Điều khoản Dịch vụ này bằng cách tham chiếu. Việc xác định xem dữ liệu cá nhân nào có thể được chia sẻ trên Hồ sơ của bạn sẽ theo ý của bạn và là trách nhiệm của bạn. Bằng cách đăng ký Dịch vụ, bạn chấp nhận các điều khoản của Điều khoản Dịch vụ này, đồng thời, cũng cho biết bạn hiểu và đồng ý với việc thu thập, sử dụng và tiết lộ thông tin được mô tả trong Chính sách về Quyền riêng tư của chúng tôi.</p>\\n<p><strong><span style=\\\"color:#c0392b\\\">V. NỘI DUNG NGƯỜI DÙNG VÀ HÀNH VI ĐỐI VỚI DỊCH VỤ</span></strong></p>\\n<p style=\\\"margin-left:40px\\\">1. Một số phần của Dịch vụ cho phép bạn tải lên trên Dịch vụ của chúng tôi bao gồm các thông tin trong phần Thông tin Đăng ký thành viên như tên, ảnh đại diện, email, số điện thoại,… Tất cả các thông tin được Người dùng đăng, tải lên, gửi qua email thuộc quyền sở hữu và trách trách nhiệm của người dùng. haitacmanhnhat.vn không chịu trách nhiệm cho bất kỳ Nội dung nào mà Người dùng tải lên, đăng, gửi email, truyền tải hoặc làm cho có sẵn thông qua Dịch vụ đồng thời không bảo đảm tính chính xác, nguyên vẹn hoặc chất lượng của các nội dung đó.<br/>\\n2. Bạn chấp thuận rằng haitacmanhnhat.vn không giám sát Nội dung Người dùng, nhưng haitacmanhnhat.vn sẽ có quyền (nhưng không phải là nghĩa vụ) từ chối, di chuyển hoặc xóa bất kỳ Nội dung Người dùng nào mà vi phạm các Điều khoản Dịch vụ hoặc (theo ý kiến của haitacmanhnhat.vn) là không hợp lệ.<br/>\\n3. haitacmanhnhat.vn không tuyên bố quyền sở hữu Nội dung Người dùng. Bằng việc gửi Nội dung Người dùng tới Dịch vụ, bạn cấp cho haitacmanhnhat.vn giấy phép trên toàn thế giới, không có phí bản quyền và độc quyền để tái tạo, chỉnh sửa và xuất bản Nội dung Người dùng.<br/>\\n4. Bạn đồng ý sử dụng Dịch vụ một cách cẩn trọng, thích hợp và hợp pháp và đảm bảo rằng bạn không vi phạm luật pháp hiện hành của quốc gia hoặc quốc tế hoặc bất kỳ quyền nào của các bên thứ ba (bao gồm cả thương hiệu, bí mật thương mại, bản quyền hoặc quyền sở hữu khác). Đặc biệt, bạn đồng ý không sử dụng Dịch vụ để:</p>\\n<p style=\\\"margin-left:80px\\\">4.1. Tải lên, đăng, bình luận, gửi email, truyền hoặc cung cấp bất kỳ Nội dung Người dùng trái pháp luật, gây hại, đe dọa, lạm dụng, quấy rối, phỉ báng, có liên quan đến chính trị, tôn giáo, có nội dung thô tục, khiêu dâm, bôi nhọ, xâm phạm quyền riêng tư của người khác, căm hờn hoặc phân biệt chủng tộc, dân tộc hoặc gây khó chịu;<br/>\\n4.2. Gây hại cho trẻ vị thành niên bằng bất kỳ cách nào;<br/>\\n4.3. Mạo danh bất kỳ cá nhân hoặc tổ chức, bao gồm nhưng không giới hạn, cán bộ, người hướng dẫn hoặc chủ của haitacmanhnhat.vn, hoặc nói sai hay xuyên tạc quan hệ của bạn với bất kỳ cá nhân hoặc tổ chức nào;<br/>\\n4.4. Sử dụng Dịch vụ làm dịch vụ chuyển tiếp đến một trang web khác;<br/>\\n4.5. Giả mạo tiêu đề hoặc sửa đổi nội dung được truyền qua Dịch vụ nhằm che giấu nguồn gốc của nội dung đó;<br/>\\n4.6. Tải lên, đăng, gửi email, truyền hoặc cung cấp bất kỳ Nội dung Người dùng nào mà bạn không có quyền cung cấp theo bất kỳ luật hoặc theo các mối quan hệ hợp đồng hoặc ủy thác (chẳng hạn như thông tin nội bộ, thông tin độc quyền và bí mật được biết đến hoặc tiết lộ như một phần của mối quan hệ công việc);<br/>\\n4.7. Tải lên, đăng, gửi email, truyền hoặc cung cấp Nội dung Người dùng vi phạm Quyền sở hữu trí tuệ (như quy định tại khoản X), hoặc quyền bảo mật của bất kỳ bên nào;<br/>\\n5.8. Tải lên, đăng, gửi email, truyền hoặc cung cấp bất kỳ quảng cáo không mong muốn hoặc không được phép, tài liệu quảng bá, \\\"thư rác\\\", hoặc bất kỳ hình thức quảng cáo nào khác;<br/>\\n4.9. Tải lên, đăng, gửi email, truyền hoặc cung cấp bất kỳ tài liệu nào chứa các virút phần mềm hoặc mã, tập tin hoặc chương trình máy tính khác được thiết kế để gây cản trở, phá hỏng hoặc hạn chế chức năng của phần mềm, phần cứng máy tính hay thiết bị viễn thông;<br/>\\n4.10. Gây cản trở hoặc phá rối Dịch vụ hoặc máy chủ, mạng kết nối với Dịch vụ, hoặc không tuân thủ bất kỳ yêu cầu, thủ tục, chính sách hoặc quy định của mạng kết nối với Dịch vụ;<br/>\\n4.11. Quấy rối Người dùng khác;<br/>\\n4.12. Thu thập hoặc lưu trữ dữ liệu cá nhân của Người dùng khác liên quan tới các hành vi và hoạt động bị cấm được nêu trong các phần trên; và/hoặc<br/>\\n4.13. Quảng bá các trang web hoặc dịch vụ khác không liên quan tới Dịch vụ được cung cấp bởi haitacmanhnhat.vn.</p>\\n<p style=\\\"margin-left:40px\\\">5. Bạn thừa nhận và đồng ý rằng haitacmanhnhat.vn có thể bảo lưu Nội dung Người dùng và cũng có thể tiết lộ Nội dung Người dùng theo yêu cầu của luật pháp hoặc khi tin tưởng một cách thiện chí rằng việc bảo lưu hoặc tiết lộ đó là cần thiết hợp lý để: (a) Tuân theo quy trình pháp lý; (b) Thực thi các Điều khoản Dịch vụ hoặc các Điều khoản về Dịch vụ phải trả tiền; (c) Giải quyết khiếu nại cho rằng Nội dung Người dùng vi phạm các quyền của bên thứ ba; hoặc (d) Bảo vệ quyền lợi, tài sản, hoặc sự an toàn cá nhân của haitacmanhnhat.vn, Người dùng của haitacmanhnhat.vn và công chúng.</p>\\n<p><strong><span style=\\\"color:#c0392b\\\">VI. NỘI DUNG BÊN THỨ BA VÀ LIÊN KẾT TỚI WEBSITE CỦA BÊN THỨ BA</span></strong></p>\\n<p style=\\\"margin-left:40px\\\">haitacmanhnhat.vn có thể chứa nội dung của bên thứ ba và liên kết đến các trang web khác (\\\"Trang web liên kết\\\"). haitacmanhnhat.vn không xác nhận, tài trợ, giới thiệu, hoặc chấp nhận trách nhiệm về bất kỳ Trang web liên kết nào. Ngoài ra, Trang web liên kết không thuộc sự kiểm soát của haitacmanhnhat.vn, và haitacmanhnhat.vn không chịu trách nhiệm về nội dung hoặc thực hành về quyền riêng tư của Trang web liên kết, bao gồm nhưng không giới hạn, các liên kết chứa trên Trang web liên kết hoặc bất cứ thay đổi hoặc cập nhật nào đối với Trang web liên kết.</p>\\n<p><strong><span style=\\\"color:#c0392b\\\">VII. CHẤM DỨT</span></strong></p>\\n<p style=\\\"margin-left:40px\\\">1. Bạn đồng ý rằng haitacmanhnhat.vn có thể chấm dứt tài khoản của bạn khi haitacmanhnhat.vn có lý do để tin rằng bạn đã vi phạm hoặc đã không tuân thủ Điều khoản Dịch vụ. Sau chấm dứt đó, haitacmanhnhat.vn có thể xóa và gỡ bỏ bất kỳ Nội dung Người dùng nào của bạn trong Dịch vụ.<br/>\\n2. haitacmanhnhat.vn có toàn quyền sửa đổi hoặc ngừng tạm thời hoặc vĩnh viễn Dịch vụ (hoặc bất kỳ phần nào của Dịch vụ) bất cứ lúc nào. Bạn đồng ý rằng haitacmanhnhat.vn không chịu trách nhiệm với bạn hoặc với bất kỳ bên thứ ba nào về việc sửa đổi hoặc ngừng cung cấp Dịch vụ (ngoại trừ phạm vi quy định tại khoản IV trên đây đối với các Dịch vụ phải trả phí), trừ khi có thoả thuận khác giữa haitacmanhnhat.vn và bên thứ ba đó.</p>\\n<p><strong><span style=\\\"color:#c0392b\\\">VIII. QUYỀN SỞ HỮU TRÍ TUỆ</span></strong></p>\\n<p style=\\\"margin-left:40px\\\">1. Bạn thừa nhận và đồng ý rằng tất cả Quyền sở hữu trí tuệ trong Dịch vụ, bất kỳ phần mềm cần thiết được sử dụng liên quan tới Dịch vụ, và tất cả nội dung (bao gồm cả văn bản, video, âm thanh, hình ảnh hoặc tài liệu khác...) chứa trên Dịch vụ ngoài Nội dung Người dùng (\\\"Nội dung\\\") thuộc về haitacmanhnhat.vn và bên cấp phép của haitacmanhnhat.vn.<br/>\\n2. Bạn chấp thuận và cam kết rằng không sử dụng hay sao chép bất kỳ nội dung nào trên Dịch vụ (bao gồm cả văn bản, video, âm thanh, hình ảnh hoặc tài liệu khác...) mà chưa được phép bằng văn bản.<br/>\\n3. Bằng việc sử dụng dịch vụ, bạn cam kết rằng:</p>\\n<p style=\\\"margin-left:80px\\\">3. 1. Không truy cập vào Dịch vụ hoặc Nội dung bằng bất cứ phương tiện nào ngoài thông qua các giao diện được cung cấp bởi haitacmanhnhat.vn để sử dụng trong việc truy cập Dịch vụ; hoặc<br/>\\n3. 2. Trừ khi được cho phép rõ ràng bởi haitacmanhnhat.vn hoặc các bên thứ ba có liên quan (bao gồm cả các nhà quảng cáo bên thứ ba), không được sửa đổi, thuê, cho thuê, cho vay, bán, phân phối hoặc tạo ra các tác phẩm dựa trên Dịch vụ, toàn bộ hoặc một phần.</p>\\n<p><strong><span style=\\\"color:#c0392b\\\">IX. LIÊN HỆ</span></strong></p>\\n<p style=\\\"margin-left:40px\\\">1. Hãy liên lạc với chúng tôi khi có bất kỳ thắc mắc hoặc để báo cáo bất kỳ hành vi vi phạm các Điều khoản Dịch vụ theo địa chỉ haitacmanhnhat.vn<br/>\\n2. haitacmanhnhat.vn có thể liên lạc với bạn và gửi cho bạn các thông báo, bao gồm cả thông báo liên quan đến những thay đổi trong Điều khoản Dịch vụ này, qua email, điện thoại bằng cách đăng ký nhận thông báo.</p>\","
      }
    ]
  }
]