{
  "slug": "cai-dat-go-bo",
  "title": "Cài đặt & gỡ bỏ",
  "created_at": "Tin tức - 06-06-2025",
  "content_html": "<p><strong><span style=\"color:#c0392b\">﻿﻿﻿﻿﻿TẢI GAME</span></strong></p>\n<p style=\"margin-left:40px\"><strong>1. Tải game:</strong></p>\n<p style=\"margin-left:80px\">Người dùng truy cập vào trang chủ chính thức của trò chơi tại địa chỉ: <a href=\"/index.html\" target=\"_blank\">https://haitacmanhnhat.vn</a><br/>\nTại trang chủ, chọn mục <strong>“Tải Game”</strong> để tải về bộ cài đặt.</p>\n<p style=\"margin-left:40px\"><strong>2. Cài đặt:</strong></p>\n<p style=\"margin-left:80px\">Sau khi tải xong, người dùng tiến hành chạy file cài đặt bằng cách nhấn <strong>Install </strong>để khởi động quá trình cài đặt game.<br/>\nQuá trình cài đặt sẽ tự động thiết lập các thành phần cần thiết và tạo một biểu tượng (shortcut) ngoài màn hình Desktop.</p>\n<p style=\"margin-left:40px\"><strong>3. Khởi chạy:</strong></p>\n<p style=\"margin-left:80px\">Sau khi cài đặt hoàn tất, phần mềm Client của game sẽ tự động bật lên. Người dùng có thể sử dụng shortcut ngoài Desktop để mở game trong những lần chơi tiếp theo.</p>\n<p style=\"margin-left:40px\"><u><strong>Ghi chú:</strong></u></p>\n<ul>\n<li>Đảm bảo kết nối Internet ổn định trong quá trình tải và cài đặt.</li>\n<li>Nếu gặp lỗi khi cài đặt, người dùng nên tắt phần mềm diệt virus hoặc chạy file cài đặt bằng quyền quản trị (Run as Administrator).<br/>\n\t </li>\n</ul>\n<p><strong><span style=\"color:#c0392b\">HƯỚNG DẪN GỠ BỎ</span></strong></p>\n<p style=\"margin-left:40px\">- Mở Cài đặt: Nhấn tổ hợp phím Windows+I hoặc click vào nút Start (biểu tượng Windows ở góc trái màn hình), sau đó chọn Cài đặt (biểu tượng bánh răng cưa).</p>\n<p style=\"margin-left:40px\">- Đi đến Ứng dụng: Trong cửa sổ Cài đặt, chọn mục Ứng dụng (Apps).</p>\n<p style=\"margin-left:40px\">- Tìm game cần gỡ: Cuộn xuống hoặc sử dụng thanh tìm kiếm để tìm tên game bạn muốn gỡ bỏ.</p>\n<p style=\"margin-left:40px\">- Gỡ cài đặt: Click vào tên game, sau đó chọn Gỡ cài đặt (Uninstall) và làm theo hướng dẫn trên màn hình để hoàn tất quá trình.</p>",
  "images": []
}