{
  "slug": "to-doi-chien-hai-tac-chien-dau-lan-1-131",
  "title": "Tổ Đội Chiến-Hải Tặc Chiến Đấu Lần 1",
  "created_at": "Sự kiện - 11-08-2025",
  "content_html": "<p><strong><span style=\"color:#3498db\">Thời gian hoạt động:</span></strong> <strong><span style=\"color:#c0392b\">10:00 ngày 11.08.2025 – 23:59 ngày 19.08.2025</span></strong></p>\n<p><strong><span style=\"color:#3498db\">Những server tham gia Tổ đội liên đấu lần này:</span></strong> <span style=\"color:#000000\">S1 ~ S22</span></p>\n<p>Hải tặc chiến đấu (Tổ Đội Chiến) chia thành 2 giai đoạn:<br/>\n•    Giai đoạn tích điểm<br/>\n•    Giai đoạn vòng trong. <br/>\nVòng tích điểm sẽ chọn ra Top 16. Đội vào vòng 16 có thể tham gia giai đoạn Vòng trong.</p>\n<p style=\"text-align:center\"><img src=\"/assets/files/uploads/files/image-20250808181449-1.png\" style=\"height:195px; width:410px\"/></p>\n<p><strong><span style=\"color:#3498db\">Giai đoạn báo danh：</span></strong>10:00 11/08/2025 đến 10:00 12/08/2025<br/>\nCấp nhân vật đạt đến lv 70 có thể tham gia Hải tặc chiến đấu,  người chơi cùng server có thể tổ đội.3 người hợp thành 1 tổ đội.</p>\n<p><strong>Quy tắc chiến đấu:<span style=\"color:#3498db\"> </span></strong>Giai đoạn tích điểm mỗi một thành viên đưa 2 đồng đội không trùng nhau ra trận (nhân vật chính có thể trùng nhau) hợp thành tiểu đội chiến đấu,  thi đấu cùng với những đội khác; giai đoạn vòng trong 3 thành viên lần lượt dùng tiểu đội 5 người của mình để chiến đấu với tiểu đội chiến đấu của 3 thành viên đối phương.</p>\n<p><strong>Thông tin chiến đấu:<span style=\"color:#3498db\"> </span></strong>Dữ liệu liên quan tới người chơi và chiến đấu là những dữ liệu liên quan ảnh hưởng đến độ mạnh yếu trong khi chiến đấu của người chơi như đồng đội,  pet,  trang bị,  trận hình,  bảo thạch,  tinh bàn…. </p>\n<p><strong>Cập nhật thông tin chiến đấu:</strong> Để bảo đảm dữ liệu của Hệ thống hải tặc chiến đấu do server lưu là dữ liệu thông tin chiến đấu mới nhất của người chơi,  sau mỗi lần người chơi thay đổi thông tin chiến đấu,  cần nhấn vào “Cập nhật thông tin chiến đấu” để truyền thông tin chiến đấu mới nhất của người chơi lên server. Trong thời gian Hải tặc chiến đấu nếu như dữ liệu thông tin chiến đấu của người chơi có thay đổi,  mà người chơi không nhấn vào “Cập nhật thông tin chiến đấu”,  thì dữ liệu thông tin chiến đấu của người chơi trong Hệ thống“Hải tặc chiến đấu” sẽ không thay đổi,  có thể sẽ dẫn đến việc thay đổi thứ tự đánh trước đánh sau.</p>\n<p><strong><span style=\"color:#3498db\">Giai đoạn tích điểm:</span></strong> 10:00 12/08/2025  đến 22:00 15/08/2025<br/>\n1.    3 thành viên mỗi 1 thành viên đưa 2 đồng đội ra trận hợp thành tiểu đội chiến đấu, đội trưởng sẽ ghép cặp đối thủ chiến đấu, và phát lệnh cặp đối thủ nào đánh trước.<br/>\n2.    Sau khi ghép cặp, có thể xem thông tin đối thủ, cũng có thể ghép cặp lại, mỗi một đội lần lượt có 3 lần xem thông tin và ghép cặp lại.<br/>\n3.    Người chơi có thể mua số lần xem thông tin và ghép cặp lại.<br/>\n4.    Mỗi lần chiến đấu sẽ có phần thưởng Beri, Danh vọng.<br/>\n5.    Hàng ngày có 25 lần thách đấu, 10:00 đến 22:00 hàng ngày có thể thách đấu.<br/>\n6.    Đội thách đấu thắng lợi có thể nhận được 20 tích điểm, thất bại nhận được 3 tích điểm.<br/>\n7.    Sau khi vòng tích điểm kết thúc căn cứ vào xếp hạng tích điểm phát thưởng, Top 16 tích điểm sẽ được vào vòng trong.</p>\n<p><strong><span style=\"color:#3498db\">Giai đoạn vòng trong:</span></strong></p>\n<p style=\"text-align:center\"><img src=\"/assets/files/uploads/files/image-20250810214144-1.png\" style=\"height:126px; width:325px\"/></p>\n<p>Top 16 được chọn ra ở vòng tích điểm chia thành 8 nhóm, mỗi nhóm 2 đội thi đấu, khoảng cách mỗi vòng là 1 ngày.</p>\n<ol>\n<li>1. Mỗi vòng thi đấu chia thành 5 ván, đội thắng 3 ván sẽ được vào vòng tiếp theo</li>\n<li>2. Mỗi ván thi đấu mỗi thành viên của 2 đội cử ra 5 đồng đội để chiến đấu với 5 đồng đội của đối phương,  bất luận thắng thua, vòng đấu tiếp theo đều thay đồng đội khác ra trận.</li>\n<li>3. Thành viên có lực chiến cao đánh trước, đội nào thắng đối phương 2 lần là đội thắng cuộc.</li>\n<li>4. Mỗi ván chiến đấu cách nhau 30 phút, trước khi mỗi ván thi đấu bắt đầu có thể điều chỉnh thứ tự ra trận của đội đó.</li>\n<li>5. Tất cả người chơi ở server của Quán quân Hải tặc chiến đấu sẽ nhận được quà toàn server.</li>\n</ol>\n<p><strong>Trợ uy: </strong>Giai đoạn vòng trong, mỗi vòng người chơi chỉ được chọn 1 tiểu đội để trợ uy, 10 phút trước mỗi vòng đấu không thể  trợ uy. Đội được trợ uy nếu như vào vòng tiếp theo, thì người chơi trợ uy có thể nhận được, 2500 Beri *lv nhân vật, 150 Danh vọng.</p>\n<p><strong>Tăng tiến tình cảm: </strong>Sau mỗi mùa Hải tặc chiến đấu kết thúc,  người chơi có thể tăng tiến tình cảm với đội quán quân,  nhấn vào “Xem quán quân”→“Tăng tiến tình cảm”,  tiêu Beri hoặc vàng là có thể nhận được phần thưởng “Tăng tiến tình cảm”,  mỗi mùa Hải tặc chiến đấu chỉ được tăng tiến tình cảm 1 lần với quán quân. Thành viên thuộc đội quán quân không được tăng tiến tình cảm.</p>\n<p><strong><span style=\"color:#3498db\">Phần thưởng</span></strong></p>\n<p><strong>Phần thưởng Top 16 Hải tặc chiến đấu:</strong></p>\n<p style=\"text-align:center\"><img src=\"/assets/files/uploads/files/image-20250810214552-2.png\" style=\"height:416px; width:683px\"/></p>\n<p style=\"text-align:center\"><img src=\"/assets/files/uploads/files/image-20250810214609-3.png\" style=\"height:307px; width:661px\"/></p>\n<p><strong>Phần thưởng vòng tích điểm Hải tặc chiến đấu:</strong></p>\n<p style=\"text-align:center\"><img src=\"/assets/files/uploads/files/image-20250810214632-4.png\" style=\"height:436px; width:663px\"/></p>\n<p style=\"text-align:center\"><img src=\"/assets/files/uploads/files/image-20250810214639-5.png\" style=\"height:281px; width:755px\"/></p>\n<p><strong>Phần thưởng trợ uy:</strong> 5000 Beri*lv nhân vật,  300 Danh vọng</p>\n<p><strong>Lễ bao Tranh Bá Quán Quán:</strong> Tất cả người chơi ở server của Quán quân được: 50000*lv Beri, 1000 Danh vọng </p>\n<p><strong>Phần thưởng Tăng tiến tình cảm:</strong></p>\n<p style=\"text-align:center\"><img src=\"/assets/files/uploads/files/image-20250810214725-6.png\" style=\"height:119px; width:564px\"/></p>",
  "images": [
    "/assets/files/uploads/files/image-20250808181449-1.png",
    "/assets/files/uploads/files/image-20250810214144-1.png",
    "/assets/files/uploads/files/image-20250810214552-2.png",
    "/assets/files/uploads/files/image-20250810214609-3.png",
    "/assets/files/uploads/files/image-20250810214632-4.png",
    "/assets/files/uploads/files/image-20250810214639-5.png",
    "/assets/files/uploads/files/image-20250810214725-6.png"
  ]
}
